[
  {
    "bookId": 1,
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://i.ibb.co/RHpB076/book-cover-To-Kill-a-Mockingbird-many-1961.webp",
    "review": "To Kill a Mockingbird is a poignant exploration of racial injustice, moral growth, and the innocence of childhood. Set in the fictional town of Maycomb, Alabama, during the Great Depression, the novel follows Scout Finch, a young girl whose father, Atticus Finch, defends a black man falsely accused of raping a white woman. Through Scout's eyes, readers witness the harsh realities of prejudice, the importance of empathy, and the resilience of the human spirit. Harper Lee's masterpiece continues to resonate with readers of all ages, reminding us of the power of compassion and the fight for justice.",
    "totalPages": 336,
    "rating": 4.5,
    "category": "Fiction",
    "tags": ["Classics", "Social Issues"],
    "publisher": "J. B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },
  {
    "bookId": 2,
    "bookName": "1984",
    "author": "George Orwell",
    "image": "https://i.ibb.co/yhM7Ch8/612-ADI-BVl-L-AC-UF1000-1000-QL80.jpg",
    "review": "1984 is a chilling portrayal of a dystopian society ruled by totalitarianism, surveillance, and thought control. Set in a world where individuality is suppressed and conformity is enforced, the novel follows Winston Smith, a disillusioned citizen who rebels against the oppressive regime of Big Brother. George Orwell's haunting vision of the future serves as a stark warning against the dangers of unchecked power and the erosion of freedom. With its timeless themes of truth, memory, and resistance, 1984 remains a powerful commentary on the human condition and the fragility of democracy.",
    "totalPages": 328,
    "rating": 4.7,
    "category": "Science Fiction",
    "tags": ["Dystopian", "Political"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "bookId": 3,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://i.ibb.co/W0WTBVn/The-Great-Gatsby-Cover-1925-Retouched.jpg",
    "review": "The Great Gatsby is a mesmerizing tale of love, greed, and the pursuit of the American Dream set against the backdrop of the Roaring Twenties. Narrated by Nick Carraway, the novel follows Jay Gatsby, a mysterious millionaire who throws extravagant parties in hopes of winning back his lost love, Daisy Buchanan. F. Scott Fitzgerald's lyrical prose and vivid imagery capture the glamour and decadence of the Jazz Age while exploring the emptiness and disillusionment lurking beneath the surface. As Gatsby's tragic story unfolds, readers are drawn into a world of opulence, obsession, and unfulfilled desires.",
    "totalPages": 180,
    "rating": 4.4,
    "category": "Fiction",
    "tags": ["Classics", "Romance"],
    "publisher": "Charles Scribner's Sons",
    "yearOfPublishing": 1925
  },
  {
    "bookId": 4,
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://i.ibb.co/mJ1Q6CF/MV5-BMTA1-NDQ3-NTcy-OTNe-QTJe-QWpw-Z15-Bb-WU3-MDA0-Mz-A4-Mz-E-V1.jpg",
    "review": "Pride and Prejudice is a delightful comedy of manners and a timeless romance that continues to captivate readers with its wit, charm, and unforgettable characters. Set in early 19th-century England, the novel follows the spirited Elizabeth Bennet as she navigates the complexities of love, class, and marriage in a society governed by strict social norms. Jane Austen's razor-sharp wit and keen observation of human nature shine through in this sparkling tale of misunderstandings, second chances, and the transformative power of love. With its enduring appeal and universal themes, Pride and Prejudice remains one of the most beloved works of English literature.",
    "totalPages": 279,
    "rating": 4.6,
    "category": "Fiction",
    "tags": ["Classics", "Romance"],
    "publisher": "T. Egerton, Whitehall",
    "yearOfPublishing": 1813
  },
  {
    "bookId": 5,
    "bookName": "Harry Potter and the Philosopher's Stone",
    "author": "J.K. Rowling",
    "image": "https://i.ibb.co/PM8yHcn/88c8fe011aa2683f66e43efe9922dafc.jpg",
    "review": "Harry Potter and the Philosopher's Stone is a magical tale of friendship, courage, and adventure that has enchanted readers of all ages around the world. Set in the wizarding world, the novel follows young Harry Potter as he discovers his true identity as a wizard and embarks on a journey to Hogwarts School of Witchcraft and Wizardry. Alongside his newfound friends Ron Weasley and Hermione Granger, Harry uncovers dark secrets and faces formidable challenges, including the malevolent wizard Voldemort. With its richly imagined world, compelling characters, and timeless themes of love and sacrifice, Harry Potter and the Philosopher's Stone is a beloved classic that continues to inspire readers of all generations.",
    "totalPages": 223,
    "rating": 4.8,
    "category": "Fantasy",
    "tags": ["Children's", "Magic"],
    "publisher": "Bloomsbury",
    "yearOfPublishing": 1997
  },
  {
    "bookId": 6,
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://i.ibb.co/vvfzTjc/The-Catcher-in-the-Rye-1951-first-edition-cover.jpg",
    "review": "The Catcher in the Rye is a timeless coming-of-age novel that explores themes of alienation, identity, and rebellion. Narrated by the disillusioned teenager Holden Caulfield, the novel follows his journey through New York City after being expelled from prep school. As Holden grapples with his inner turmoil and confronts the phoniness of the adult world, he searches for authenticity and meaning in a society he perceives as superficial and hypocritical. J.D. Salinger's poignant portrayal of adolescent angst and existential crisis resonates with readers of all ages, making The Catcher in the Rye a modern classic that continues to capture the imagination of generations.",
    "totalPages": 224,
    "rating": 4.3,
    "category": "Fiction",
    "tags": ["Classics", "Coming-of-Age"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  }
]
